{
    "password-generator": "Create a random password generator using Python.",
    "rock-paper-scissors": "Develop a Rock-Paper-Scissors game in Python.",
    "weather-app": "Generate a Python application that fetches and displays weather information.",
    "simple-web-scraper": "Create a Python script that scrapes data from a website.",
    "currency-converter": "Develop a currency converter application in Python.",
    "quiz-app": "Build a quiz application in Python with multiple-choice questions.",
    "binary-search": "Write a Python program that performs a binary search on a sorted list.",
    "url-shortener": "Create a URL shortener in Python.",
    "alarm-clock": "Develop a simple alarm clock application using Python.",
    "pomodoro-timer": "Create a Pomodoro timer in Python.",
    "mad-libs": "Generate a Python program that creates Mad Libs stories.",
    "hangman-game": "Write a Hangman game in Python.",
    "calendar-app": "Build a basic calendar application using Python.",
    "tic-tac-toe-ai": "Develop a Tic-Tac-Toe game with AI in Python.",
    "chatbot": "Create a simple chatbot using Python.",
    "file-encryption": "Write a Python program that encrypts and decrypts files.",
    "stopwatch": "Build a stopwatch application in Python.",
    "unit-converter": "Develop a unit converter in Python.",
    "text-editor": "Create a simple text editor in Python.",
    "personal-diary": "Build a personal diary application using Python.",
    "contact-book": "Develop a contact book application in Python.",
    "pdf-merger": "Write a Python script to merge PDF files.",
    "todo-cli": "Create a command-line interface to-do list application in Python.",
    "word-counter": "Develop a word counter application in Python.",
    "timer-app": "Create a countdown timer in Python.",
    "simple-chat-application": "Build a simple chat application using Python.",
    "morse-code-converter": "Write a Python program that converts text to Morse code and vice versa.",
    "birthday-reminder": "Develop a birthday reminder application in Python.",
    "flask-hello-world": "Create a simple Flask web application in Python.",
    "expense-tracker": "Build an expense tracker application using Python.",
    "ascii-art-generator": "Write a Python program that generates ASCII art from text or images.",
    "json-to-csv": "Create a Python script that converts JSON files to CSV.",
    "tic-tac-toe-console": "Develop a console-based Tic-Tac-Toe game in Python.",
    "text-adventure-game": "Write a simple text adventure game in Python.",
    "http-server": "Create a basic HTTP server using Python.",
    "markdown-to-html": "Write a Python program that converts Markdown files to HTML.",
    "file-compressor": "Develop a Python script to compress files into ZIP format.",
    "mp3-player": "Create a simple MP3 player in Python.",
    "scientific-calculator": "Develop a scientific calculator using Python.",
    "image-viewer": "Build a basic image viewer application in Python.",
    "portfolio-website": "Create a personal portfolio website using Python and Flask.",
    "data-visualizer": "Write a Python script that visualizes data using Matplotlib or Plotly.",
    "maze-generator": "Develop a maze generator and solver in Python.",
    "space-invaders-game": "Create a Space Invaders game in Python.",
    "memory-game": "Build a memory card game in Python.",
    "file-organizer": "Write a Python program that organizes files in directories based on file type.",
    "roman-numeral-converter": "Develop a Python script that converts numbers to Roman numerals and vice versa.",
    "web-crawler": "Create a simple web crawler in Python.",
    "email-sender": "Write a Python script that sends emails.",
    "music-player": "Build a basic music player application using Python.",
    "snake-ai": "Develop a Snake game with AI in Python.",
    "game-of-life": "Create a Python implementation of Conway's Game of Life.",
    "language-translator": "Write a Python program that translates text between different languages.",
    "chess-game": "Develop a basic chess game in Python.",
    "task-reminder": "Create a task reminder application using Python.",
    "simple-blog": "Build a simple blog website using Python and Flask.",
    "flashcards-app": "Write a flashcards application in Python.",
    "markdown-editor": "Create a simple Markdown editor using Python.",
    "captcha-generator": "Develop a Python script to generate CAPTCHA images.",
    "word-search-generator": "Write a Python program that generates word search puzzles.",
    "2048-game": "Build a 2048 game in Python.",
    "simple-paint-app": "Create a basic paint application using Python.",
    "turtle-graphics": "Develop a Python program that draws shapes using Turtle graphics.",
    "todo-app-gui": "Create a GUI-based to-do list application in Python.",
    "language-detection": "Write a Python program that detects the language of a given text.",
    "budget-calculator": "Develop a budget calculator application using Python.",
    "simple-blog-cli": "Create a command-line interface blog application in Python.",
    "pdf-splitter": "Write a Python script to split PDF files.",
    "simple-web-crawler": "Develop a simple web crawler using Python.",
    "social-media-scraper": "Create a Python script to scrape data from social media platforms.",
    "math-quiz": "Write a math quiz application in Python.",
    "file-backup": "Develop a Python program to backup important files.",
    "bmi-calculator": "Create a BMI calculator using Python.",
    "command-line-chat": "Write a command-line chat application in Python.",
    "todo-app-flask": "Develop a Flask-based to-do list application in Python.",
    "alarm-clock-gui": "Create a GUI-based alarm clock in Python.",
    "shopping-list": "Build a shopping list application using Python.",
    "tic-tac-toe-gui": "Write a GUI-based Tic-Tac-Toe game in Python.",
    "binary-clock": "Create a binary clock using Python.",
    "text-analyzer": "Develop a text analyzer application in Python.",
    "simple-database-app": "Write a simple database application using Python and SQLite.",
    "unit-testing": "Create a Python project that demonstrates unit testing with pytest.",
    "youtube-downloader": "Develop a YouTube video downloader using Python.",
    "random-quote-generator": "Create a Python program that generates random quotes.",
    "website-blocker": "Write a Python script that blocks websites during certain times.",
    "color-picker": "Develop a color picker application using Python.",
    "random-user-generator": "Create a Python script that generates random user data.",
    "simple-web-form": "Write a simple web form using Python and Flask.",
    "currency-converter-gui": "Build a GUI-based currency converter using Python.",
    "simple-notepad": "Develop a basic notepad application in Python.",
    "file-search": "Create a Python program that searches for files in a directory.",
    "typing-speed-test": "Write a typing speed test application in Python."
}